Revit 2027 API
RelinquishOptions.UserWorksets Property
 True means all user-created worksets owned by the current user should be relinquished. False means none of these are relinquished.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UserWorksets { get; set; }
Public Property UserWorksets As Boolean
	Get
	Set
public:
property bool UserWorksets {
	bool get ();
	void set (bool value);
}
member UserWorksets : bool with get, set
Property Value
Boolean
Remarks
 This defaults to false in the User Interface.
See Also
Reference
RelinquishOptions Class
Autodesk.Revit.DB Namespace